print("------------------------------------")
# 1、	定义一个整型变量，输出该变量的值
print("定义一个整型变量，输出该变量的值")
a = 1
print(a)
print("------------------------------------")
# 2、	定义一个浮点类型变量，输出该变量的值
print("定义一个浮点类型变量，输出该变量的值")
b = 1.0
print(b)
print("------------------------------------")
# 3、	定义一个字符串型变量，输出该变量的值。
print("定义一个字符串型变量，输出该变量的值。")
c = '我是第三个'
print(c)
print("------------------------------------")
# 4、	定义一个布尔类型的数据，输出其结果
print("定义一个布尔类型的数据，输出其结果")
d = True
print(d)
print("------------------------------------")
# 5、	求两个数的和
print("求两个数的和")
print(a + b)
print("------------------------------------")
# 6、	求圆的面积
print("求圆的面积")
import math as m

r = 3
print(r ** 2 * m.pi)
print("------------------------------------")
# 7、	定义两个整型变量 a b ， 求a+b    a-b    a%b  a/b  (要求除尽，) 的结果
print("定义两个整型变量 a b ， 求a+b    a-b    a%b  a/b  (要求除尽，) 的结果")
a = 1
b = 2
print(a + b)
print(a - b)
print(a % b)
print(a / b)
print("------------------------------------")
# 8、	编写程序，已知 圆柱体的 底面半径R，和高H，  求圆柱体的体积 V=PI*r*r*h
print("编写程序，已知 圆柱体的 底面半径R，和高H，  求圆柱体的体积 V=PI*r*r*h")
R = 10
H = 5
print(f"面积为:{m.pi * R * R * H}")
print("------------------------------------")
# 9、	求一个长方形的周长和面积。
print("求一个长方形的周长和面积。")
c = 10
k = 20
print(f"周长是:{(c + k) * 2}")
print(f"面积是:{c * k}")
print("------------------------------------")
# 10、	求一个三角形的面积。
print("求一个三角形的面积。")
print(f"这个三角形的面积是:{c * k / 2}")
print("------------------------------------")
# 11、	python的第一个发行版本在那一年？
print("python的第一个发行版本在那一年？")
print("1991年")
print("------------------------------------")
# 12、	python的创始人叫什么名字？
print("python的创始人叫什么名字？")
print("吉多.范罗苏姆")
print("------------------------------------")
# 13、	 python这个单词翻译成中文是什么意思？
print("python这个单词翻译成中文是什么意思？")
print("蟒蛇")
print("------------------------------------")
# 14、	python的应用领域？
print("python的应用领域？")
print("数据分析")
print("Web开发")
print("人工智能")
print("自动化测试与运维")
print("等等等等...")
print("------------------------------------")
# 15、	变量的命名规则有几点？分别是什么？
print("变量的命名规则有几点？分别是什么？")
print("1.以数字字母下划线组成")
print("2.不能以数字开头")
print("3.区分大小写")
print("4.见名知意")
print("5.不能是关键字")
print("6.驼峰（下划线更好）")
print("------------------------------------")
# 16、	定义人的属性信息变量，并赋值。其中包含整数类型，浮点类型，字符串类型以及布尔类型，每个类型变量至少两个。
print("定义人的属性信息变量，并赋值。其中包含整数类型，浮点类型，字符串类型以及布尔类型，每个类型变量至少两个。")


class People:
    height = 183
    shoe_size = 42
    weight = 75.0
    vision = 5.0
    name = "luoboovo"
    qq_number = "1334247301"


print("------------------------------------")
# 17、	定义一个整数类型变量和一个浮点类型变量，求两个变量的和，差，积，商
print("定义一个整数类型变量和一个浮点类型变量，求两个变量的和，差，积，商")
int_variable = 2048
float_variable = 2048.0
print(int_variable + float_variable)
print(int_variable - float_variable)
print(int_variable * float_variable)
print(int_variable / float_variable)
print("------------------------------------")
# 18、	给定圆的半径r=2,求圆的面积和周长
print("给定圆的半径r=2,求圆的面积和周长")
round_r = 2
print(m.pi * round_r * round_r)
print("------------------------------------")
# 19、	计算并写出  15%4     10//3      3**4     的值
print("计算并写出  15%4     10//3      3**4     的值")
print(15 % 4)
print(10 // 3)
print(3 ** 4)
print("------------------------------------")
# 20、	计算并写出
print("------------------------------------")
# 1)   2<1 and (1/0)<0
print("------------------------------------")
# 2)   False or (1/0)<0
print("------------------------------------")
# 3)   "are" in "how are you" and (1/0)<0
print("------------------------------------")
# 4)   "is" in "how are you" or (1/0)<0
print("""计算并写出
1)   2<1 and (1/0)<0
2)   False or (1/0)<0
3)   "are" in "how are you" and (1/0)<0
4)   "is" in "how are you" or (1/0)<0" """)

try:
    print(2 < 1 and (1 / 0) < 0)
    print(False or (1 / 0) < 0)
    print("are" in "how are you" and (1 / 0) < 0)
    print("is" in "how are you" or (1 / 0) < 0)
except:
    pass
print("------------------------------------")
# 21、	设a=9; 分别求出 a+=10 , a-=5, a*=8, a/=3的结果
print("设a=9; 分别求出 a+=10 , a-=5, a*=8, a/=3的结果")
a = 9
print(a)
a += 10
print(a)
a -= 5
print(a)
a *= 8
print(a)
a /= 3
print(a)
print("------------------------------------")
# 22、	设a=9,b=9; 求出  print(a>b); 的结果
print("设a=9,b=9; 求出  print(a>b); 的结果")
a = 9
b = 9
print(a > b)
print("------------------------------------")
# 23、	定义一个大 写字母，把它转换为小写字母后显示出来。
print("定义一个大 写字母，把它转换为小写字母后显示出来。")
word = 'A'
print(word.lower())
print("------------------------------------")
# 24、	定义一个圆的半径，求圆的周长，圆的面积，圆球表面积，圆球的体积。输出结果时要求有文字说明，保留2位小数。
print("定义一个圆的半径，求圆的周长，圆的面积，圆球表面积，圆球的体积。输出结果时要求有文字说明，保留2位小数。")
r = 5
PI = m.pi
print(f"周长为:{round(2 * PI * r, 2)}")
print(f"面积为:{round(PI * r * r, 2)}")
print(f"圆球表面积为:{round(4 * PI * r * r, 2)}")
print(f"圆球体积为:{round(4 / 3 * PI * r * r * r, 2)}")
print("------------------------------------")
# 25、	设圆的半径为R ,则周长 =2*PI*R 面积 PI*r*r  圆球表面积 4*PI*r*r  圆球体积： 4/3*PI*r*r*r
print("------------------------------------")
# 26、	定义三个数a=10,b=20,c=30，（（a>=b）= =(b= =c)= =(c<a)）的结果；（a!=b）==(a!=c)==(c==a) 的结果；! (a>b) 的结果
print("定义三个数a=10,b=20,c=30，（（a>=b）= =(b= =c)= =(c<a)）的结果；（a!=b）==(a!=c)==(c==a) 的结果；! (a>b) 的结果")
a = 10
b = 20
c = 30
print((a >= b) == (b == c) == (c < a))
print((a != b) == (a != c) == (c == a))
print(not (a > b))

print("------------------------------------")
# 27、	设 x=5, 计算  x*=x/=x+x 的结果
print("设 x=5, 计算  x*=x/=x+x 的结果")
x = 5
x *= x
x /= x + x
print(x)
print("------------------------------------")
# 28、	设a=1,b=3,c=9;则计算m=(a>b)&&(b<c);
print("设a=1,b=3,c=9;则计算m=(a>b)&&(b<c)")
a = 1
b = 3
c = 9
m = (a > b) and (b < c)
print(m)
print("m=  ((a>=b)&&(b==c)||(c<a))")
m = ((a >= b) and (b == c) or (c < a))
print(m)
print("------------------------------------")
